app/views/comments/index.html.erb

	<div class="comments">
		<% @event.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ?  [["event_id", 13]]