app/views/events/_fields.html.erb

SELECT "fields".* FROM "fields" WHERE "fields"."event_id" = ?  [["event_id", 23]]
---
<% @event.fields.each do |field| %>