app/views/events/show.html.erb


	<%= render 'fields', locals: { field: @event.fields } unless @event.fields.blank? || @event.fields.nil? %>
---
SELECT "fields".* FROM "fields" WHERE "fields"."event_id" = ?  [["event_id", 22]]