app/controllers/callbacks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "digitalh2o@gmail.com"]]
UPDATE "users" SET "last_sign_in_at" = ?, "current_sign_in_at" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_sign_in_at", "2016-08-27 01:28:42.124296"], ["current_sign_in_at", "2016-08-27 01:29:35.600008"], ["sign_in_count", 3], ["updated_at", "2016-08-27 01:29:35.600971"], ["id", 2]]
---
	def facebook
		if user = User.find_by(email: request.env["omniauth.auth"].info.email)
			user.update(uid: request.env["omniauth.auth"].uid)