app/controllers/comments_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", nil]]
SELECT "comments".* FROM "comments"
---
	def index
		@event = Event.find(params[:event_id])
		@comments = Comment.all

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", nil]]
---
	def new
		@event = Event.find(params[:event_id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 14]]
---
	def create
		@event = Event.find(params[:event_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 2]]
---
	def set_current_comment
		@comment = Comment.find(params[:id])