app/controllers/events_controller.rb

	def index
		if !user_signed_in?
			flash[:alert] = "You must sign in to view the Events"
			redirect_to new_user_session_path
		else
			@events = Event.all
---
SELECT "events".* FROM "events"

	def create
		@event = Event.new(event_params)
		if @event.valid?
			@event.user_id = current_user.id
			@event.save
---
INSERT INTO "events" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "New Event"], ["description", "Am I finally figuring this thing out?"], ["user_id", 1], ["created_at", "2016-08-26 00:44:04.269685"], ["updated_at", "2016-08-26 00:44:04.269685"]]

	def update
		if @event.update(event_params)
---
UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "Am I finally figuring this thing out? Test"], ["updated_at", "2016-08-26 00:57:57.812247"], ["id", 10]]

	def set_current_event
		@event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 10]]